results/throughput/throughput-distilled_student_mid-20260309T085245Z/stdout.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f8e26b9ad40>, seed=42, num_prompts=10000, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='results/distill/merged-qwen2.5-7b', input_len=512, output_len=256, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=200, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='results/throughput/throughput-distilled_student_mid-20260309T085245Z/vllm_bench_raw.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-9a4f13f0-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-09 09:52:57 [datasets.py:612] Sampling input_len from [512, 512] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 200 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     10000     
Failed requests:                         0         
Benchmark duration (s):                  391.35    
Total input tokens:                      5120000   
Total generated tokens:                  2560000   
Request throughput (req/s):              25.55     
Output token throughput (tok/s):         6541.47   
Peak output token throughput (tok/s):    15719.00  
Peak concurrent requests:                10000.00  
Total token throughput (tok/s):          19624.40  
---------------Time to First Token----------------
Mean TTFT (ms):                          192081.41 
Median TTFT (ms):                        191059.53 
P99 TTFT (ms):                           379596.25 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.87     
Median TPOT (ms):                        38.22     
P99 TPOT (ms):                           38.50     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.87     
Median ITL (ms):                         28.95     
P99 ITL (ms):                            64.98     
==================================================